#+title: Cross_tab

#+PROPERTY: header-args:jupyter-python



#+begin_src jupyter-python
display_width = 220

import pandas as pd
pd.set_option('display.width', display_width)

import numpy as np
np.set_printoptions(linewidth=display_width)
#+end_src

#+RESULTS:

#+begin_src jupyter-python

# Sample data
gender = ['Male', 'Female', 'Male', 'Male', 'Female', 'Female']
drink = ['Tea', 'Coffee', 'Coffee', 'Tea', 'Tea', 'Coffee']

# Using crosstab to see the breakdown of gender by drink choice
table = pd.crosstab(gender, drink)
print(table)

#+end_src

#+RESULTS:
: col_0   Coffee  Tea
: row_0
: Female       2    1
: Male         1    2

#+begin_src jupyter-python

# Sample data
gender = ['Male', 'Female', 'Male', 'Male', 'Female', 'Female', 'Male', 'Female']
drink = ['Tea', 'Coffee', 'Coffee', 'Tea', 'Tea', 'Coffee', 'Tea', 'Coffee']
variation = ['GreenTea', 'Americano', 'Cappuccino', 'RedTea', 'GreenTea', 'Americano', 'RedTea', 'Cappuccino']

# Using crosstab to see the breakdown of gender by drink choice and its variation
table = pd.crosstab(gender, [drink, variation])
print(table)

#+end_src

#+RESULTS:
: col_0     Coffee                 Tea
: col_1  Americano Cappuccino GreenTea RedTea
: row_0
: Female         2          1        1      0
: Male           0          1        1      2


#+begin_src jupyter-python

#+end_src
